greet = ("Привет, балапанчик, я DALL-EDA. "
         "Задавай мне вопросы и я постараюсь ответить. ")

menu = "📍 Главное меню"
gen_text = "Отправьте текст запроса к нейросети для генерации текста"
gen_image = "Отправьте текст запроса к нейросети для генерации изображения"
edit_image = "Отправьте текст запроса к нейросети для изменения изображения"
gen_exit = "Чтобы выйти из диалога с нейросетью нажмите на кнопку ниже"
gen_error = (
    "🚫 Ошибка генерации. Возможные причины:\n"
    "1. Перегружены сервера OpenAI\n"
    "2. Ваш запрос нарушил правила OpenAI\n"
    "3. Ошибка в работе бота\n"
    "Если вы считаете, что проблема вызвана "
    "неисправностью бота, сообщите админу"
)


gen_wait = "⏳Пожалуйста, подождите немного, " \
           "пока нейросеть обрабатывает ваш запрос..."

err = "🚫 К сожалению произошла ошибка, попробуйте позже"

orig_img = "Отправьте фото, которое хотите изменить"
mask_img = "Теперь отправьте фото с отмеченной зоной, которую хотите изменить"
edit_prompt = "Опишите изменения на фото"
